In [1]:
#Import Libraries 
import pandas as pd 
import io 
import numpy as numpy
import pyodbc
#Load CSV
data = pd.read_csv("FireBrigadeAndAmbulanceCallOuts.csv") 
print(data)

             Date    Station Area   Description       TOC       ORD       MOB  \
0      01/01/2013     Rathfarnham     S/S OTHER  01:27:19  01:28:58  01:30:47
1      01/01/2013        Tallaght      Fire CAR  01:49:57  01:50:40  01:51:47
2      01/01/2013    North Strand       S/S RTA  03:35:24  03:36:14  03:38:28
3      01/01/2013        Tallaght      Fire CAR  04:12:51  04:13:56  04:14:32
4      01/01/2013         Finglas  Fire DOM PER  04:14:24  04:15:36  04:17:37
...           ...             ...           ...       ...       ...       ...
38551  28/04/2018  Blanchardstown    Fire ALARM  23:57:36  23:59:00  00:01:09
38552  09/10/2018      Kilbarrack      Fire CAR  23:58:18  23:59:14  00:00:48
38553  07/06/2018        Skerries    Fire SMALL  23:56:49  23:59:23  00:00:41
38554  21/11/2018      Donnybrook    Fire ALARM  23:58:57  23:59:26  00:00:59
38555  01/01/2019      Kilbarrack    Fire ALARM  23:58:18  23:59:48  00:01:36

             IA        LS        AH       MAV        CD
0      01:58:54  02:08:54  02:28:54  02:48:54  03:08:54
1      01:55:43  02:05:43  02:25:43  02:45:43  03:05:43
2      03:41:20  03:51:20  04:11:20  04:31:20  04:51:20
3      04:20:48  04:30:48  04:50:48  05:10:48  05:30:48
4      04:20:47  04:30:47  04:50:47  05:10:47  05:30:47
...         ...       ...       ...       ...       ...
38551  00:09:30  00:19:30       NaN  00:20:00  00:40:00
38552  00:07:55  00:17:55       NaN  00:20:00  00:40:00
38553  00:19:49  00:29:49       NaN         -         -
38554  00:04:23  00:14:23       NaN         -         -
38555  00:14:18  00:24:18       NaN         -         -

[38556 rows x 11 columns]

In [5]:
#Total number of rows and columns are
print("Total number of rows are:", data.shape[0])
print("Total number of columns are:", data.shape[1])

Total number of rows are: 38556
Total number of columns are: 11

In [6]:
#Number of non nul rows
print("The number of non null rows (by column)\n\n",data.notnull().sum())

The number of non null rows (by column)

 Date            38556
Station Area    38556
Description     38556
TOC             38556
ORD             38556
MOB             37311
IA              30962
LS              38556
AH                153
MAV             38530
CD              38530
dtype: int64

In [7]:
#Number of null values (by column)
count=data.isnull().sum()
print(count)

Date                0
Station Area        0
Description         0
TOC                 0
ORD                 0
MOB              1245
IA               7594
LS                  0
AH              38403
MAV                26
CD                 26
dtype: int64

In [9]:
#The number of null values for all columns
print("The number of null values for all columns are",sum(count))

The number of null values for all columns are 47294

In [11]:
#The total number of call outs by Station Area
print(data.groupby(['Station Area']).count())

                Date  Description   TOC   ORD   MOB    IA    LS  AH   MAV  \
Station Area
Balbriggan       688          688   688   688   668   548   688   5   688
Blanchardstown  2089         2089  2089  2089  2006  1630  2089   6  2088
Dolphins Barn   4018         4018  4018  4018  3892  3407  4018  15  4013
Donnybrook      1787         1787  1787  1787  1718  1449  1787   9  1785
Dun Laoghaire   3271         3271  3271  3271  3213  2513  3271  21  3268
Dunshaughlin       2            2     2     2     2     1     2   0     2
Finglas         3030         3030  3030  3030  2913  2392  3030  12  3027
Kilbarrack      3548         3548  3548  3548  3452  2833  3548  17  3545
MH14               1            1     1     1     1     1     1   0     1
North Strand    1645         1645  1645  1645  1545  1320  1645   5  1644
Phibsborough    3160         3160  3160  3160  3039  2602  3160  10  3159
Rathfarnham     2129         2129  2129  2129  2066  1629  2129   5  2129
Skerries         449          449   449   449   433   379   449   1   449
Swords          2614         2614  2614  2614  2540  2034  2614   8  2614
Tallaght        6525         6525  6525  6525  6381  5214  6525  30  6521
Tara St         3600         3600  3600  3600  3442  3010  3600   9  3597

                  CD
Station Area
Balbriggan       688
Blanchardstown  2088
Dolphins Barn   4013
Donnybrook      1785
Dun Laoghaire   3268
Dunshaughlin       2
Finglas         3027
Kilbarrack      3545
MH14               1
North Strand    1644
Phibsborough    3159
Rathfarnham     2129
Skerries         449
Swords          2614
Tallaght        6521
Tara St         3597

In [53]:
#The total Number of call outs by Station Area and Date
print(data.groupby(['StationArea','Date'])['StationArea'].count())

StationArea  Date
Balbriggan   01/01/2013     3
             01/01/2014     1
             01/02/2014     2
             01/03/2013     1
             01/03/2014     1
                           ..
Tara St      31/10/2013     9
             31/10/2014    11
             31/10/2015     5
             31/12/2013     4
             31/12/2014     3
Name: StationArea, Length: 12483, dtype: int64

In [16]:
#The total Number of call outs by Station Area and Date where the description is either Fire Car or Fire Alarm.
data1=data.loc[data['Description'].isin(['Fire Car','Fire ALARM'])]
data1.groupby(["Station Area","Date","Description"]).count()

                                     TOC  ORD  MOB  IA  LS  AH  MAV  CD
Station Area Date       Description
Balbriggan   01/01/2013 Fire ALARM     2    2    2   1   2   2    2   2
             01/01/2014 Fire ALARM     1    1    1   1   1   0    1   1
             02/03/2013 Fire ALARM     1    1    1   0   1   0    1   1
             02/06/2013 Fire ALARM     1    1    1   1   1   0    1   1
             02/11/2013 Fire ALARM     1    1    1   1   1   0    1   1
...                                  ...  ...  ...  ..  ..  ..  ...  ..
Tara St      31/07/2015 Fire ALARM     2    2    2   2   2   0    2   2
             31/08/2013 Fire ALARM     1    1    1   1   1   0    1   1
             31/10/2014 Fire ALARM     1    1    1   1   1   0    1   1
             31/10/2015 Fire ALARM     1    1    1   1   1   0    1   1
             31/12/2013 Fire ALARM     1    1    1   1   1   0    1   1

[5236 rows x 8 columns]

In [18]:
#Replacing any instance of ',' (in any column) with an empty string
new_data=data.replace(',','')
print(new_data)

             Date    Station Area   Description       TOC       ORD       MOB  \
0      01/01/2013     Rathfarnham     S/S OTHER  01:27:19  01:28:58  01:30:47
1      01/01/2013        Tallaght      Fire CAR  01:49:57  01:50:40  01:51:47
2      01/01/2013    North Strand       S/S RTA  03:35:24  03:36:14  03:38:28
3      01/01/2013        Tallaght      Fire CAR  04:12:51  04:13:56  04:14:32
4      01/01/2013         Finglas  Fire DOM PER  04:14:24  04:15:36  04:17:37
...           ...             ...           ...       ...       ...       ...
38551  28/04/2018  Blanchardstown    Fire ALARM  23:57:36  23:59:00  00:01:09
38552  09/10/2018      Kilbarrack      Fire CAR  23:58:18  23:59:14  00:00:48
38553  07/06/2018        Skerries    Fire SMALL  23:56:49  23:59:23  00:00:41
38554  21/11/2018      Donnybrook    Fire ALARM  23:58:57  23:59:26  00:00:59
38555  01/01/2019      Kilbarrack    Fire ALARM  23:58:18  23:59:48  00:01:36

             IA        LS        AH       MAV        CD
0      01:58:54  02:08:54  02:28:54  02:48:54  03:08:54
1      01:55:43  02:05:43  02:25:43  02:45:43  03:05:43
2      03:41:20  03:51:20  04:11:20  04:31:20  04:51:20
3      04:20:48  04:30:48  04:50:48  05:10:48  05:30:48
4      04:20:47  04:30:47  04:50:47  05:10:47  05:30:47
...         ...       ...       ...       ...       ...
38551  00:09:30  00:19:30       NaN  00:20:00  00:40:00
38552  00:07:55  00:17:55       NaN  00:20:00  00:40:00
38553  00:19:49  00:29:49       NaN         -         -
38554  00:04:23  00:14:23       NaN         -         -
38555  00:14:18  00:24:18       NaN         -         -

[38556 rows x 11 columns]

In [59]:
#Replacing any instance of '_' (in any column) with an empty string.
R=remove_dash=data.replace("-" ,"")
R

,Date,StationArea,Description,TOC,ORD,MOB,IA,LS,AH,MAV,CD
0,01/01/2013,Rathfarnham,S/S OTHER,01:27:19,01:28:58,01:30:47,01:58:54,02:08:54,02:28:54,02:48:54,03:08:54
1,01/01/2013,Tallaght,Fire CAR,01:49:57,01:50:40,01:51:47,01:55:43,02:05:43,02:25:43,02:45:43,03:05:43
2,01/01/2013,North Strand,S/S RTA,03:35:24,03:36:14,03:38:28,03:41:20,03:51:20,04:11:20,04:31:20,04:51:20
3,01/01/2013,Tallaght,Fire CAR,04:12:51,04:13:56,04:14:32,04:20:48,04:30:48,04:50:48,05:10:48,05:30:48
4,01/01/2013,Finglas,Fire DOM PER,04:14:24,04:15:36,04:17:37,04:20:47,04:30:47,04:50:47,05:10:47,05:30:47
...,...,...,...,...,...,...,...,...,...,...,...
38551,28/04/2018,Blanchardstown,Fire ALARM,23:57:36,23:59:00,00:01:09,00:09:30,00:19:30,0,00:20:00,00:40:00
38552,09/10/2018,Kilbarrack,Fire CAR,23:58:18,23:59:14,00:00:48,00:07:55,00:17:55,0,00:20:00,00:40:00
38553,07/06/2018,Skerries,Fire SMALL,23:56:49,23:59:23,00:00:41,00:19:49,00:29:49,0,,
38554,21/11/2018,Donnybrook,Fire ALARM,23:58:57,23:59:26,00:00:59,00:04:23,00:14:23,0,,
38555,01/01/2019,Kilbarrack,Fire ALARM,23:58:18,23:59:48,00:01:36,00:14:18,00:24:18,0,,

In [41]:
# Drop rows for the columns (AH, MAV, CD) where at least one row value is NULL.
new_data2=new_data.dropna(subset=['AH','MAV','CD'])
null_values=new_data2[new_data2["AH"]==''].index
new_data3=new_data2.drop(null_values)
new_data3

,Date,Station Area,Description,TOC,ORD,MOB,IA,LS,AH,MAV,CD
0,01/01/2013,Rathfarnham,S/S OTHER,01:27:19,01:28:58,01:30:47,01:58:54,02:08:54,02:28:54,02:48:54,03:08:54
1,01/01/2013,Tallaght,Fire CAR,01:49:57,01:50:40,01:51:47,01:55:43,02:05:43,02:25:43,02:45:43,03:05:43
2,01/01/2013,North Strand,S/S RTA,03:35:24,03:36:14,03:38:28,03:41:20,03:51:20,04:11:20,04:31:20,04:51:20
3,01/01/2013,Tallaght,Fire CAR,04:12:51,04:13:56,04:14:32,04:20:48,04:30:48,04:50:48,05:10:48,05:30:48
4,01/01/2013,Finglas,Fire DOM PER,04:14:24,04:15:36,04:17:37,04:20:47,04:30:47,04:50:47,05:10:47,05:30:47
...,...,...,...,...,...,...,...,...,...,...,...
169,05/01/2013,Dun Laoghaire,S/S AMBASS,23:03:21,23:04:19,23:05:40,NaN,00:10:00,00:30:00,00:50:00,01:10:00
170,05/01/2013,Phibsborough,Fire ALARM,23:22:52,23:23:23,23:25:06,23:33:35,23:43:35,00:03:35,00:23:35,00:43:35
171,05/01/2013,Tallaght,Fire CAR,23:25:22,23:27:11,23:29:08,23:34:41,23:44:41,00:04:41,00:24:41,00:44:41
172,05/01/2013,Kilbarrack,Fire SMALL,23:43:23,23:44:34,NaN,23:49:07,23:59:07,00:19:07,00:39:07,00:59:07
173,06/01/2013,Blanchardstown,Fire CAR,00:01:25,00:03:57,00:05:12,00:08:32,00:18:32,00:38:32,00:58:32,01:18:32

In [7]:
# Replace any instance of “-” (in any column) with an empty string.
values = ["AH","MAV","CD"]
data.dropna(subset = values,inplace=True)
print(data.shape)

(153, 11)

In [9]:
#  Drop rows for the columns (AH, MAV, CD) where at least one row value is NULL
print(data.duplicated().sum())

1

In [10]:
# Drop any duplicate rows (except for the first occurrence)
data.drop_duplicates(keep = 'first',inplace=True)
print(data.shape)

(152, 11)

In [8]:
#Output the minimum time difference between TOC and ORD.
Toc=pd.to_datetime(data["TOC"])
Ord=pd.to_datetime(data["ORD"])
diffrence = Ord-Toc
print(diffrence.min())

0 days 00:00:30

In [23]:
data.rename(columns={'Station Area':'StationArea'},inplace=True)
data=data.fillna(0)

In [61]:
# Using the resulting data set, post implementing the previous cleansing steps, load the data into a table in SQL Server. (Note: you must create the physical table in SQL Server to complete this task. Use the same column names as the columns in the CSV File.) 
conn_str = (
    r'DRIVER={SQL Server};'
    r'SERVER=DESKTOP-8DHBPEL\SQLEXPRESS;'
    r'DATABASE=fb2;'
    r'Trusted_Connection=yes;'
)

cnxn = pyodbc.connect(conn_str)
cursor = cnxn.cursor()


for row in data.itertuples():
    cursor.execute('''
                INSERT INTO fb2.dbo.fbtable(DATE,STATION_AREA,DESCRIPTION,TOC,ORD,MOB,IA,LS,AH,MAV,CD)
                VALUES (?,?,?,?,?,?,?,?,?,?,?)
                ''',
                row.Date,
                row.StationArea,
                row.Description,
                row.TOC,
                row.ORD, 
                row.MOB, 
                row.IA,
                row.LS, 
                row.AH,
                row.MAV, 
                row.CD
               
                )
cnxn.commit()